app/controllers/lostfounds_controller.rb

  def index
    if params[:search]
            @lostfounds= Lostfound.where('name LIKE ? OR detail LIKE?', "%#{params[:search]}%", "%#{params[:search]}%")
    else
            @lostfounds = Lostfound.all
---
SELECT "lostfounds".* FROM "lostfounds" WHERE (name LIKE '%%' OR detail LIKE'%%')
SELECT "lostfounds".* FROM "lostfounds"

  def create
    @lostfound = Lostfound.new(lostfound_params)

    respond_to do |format|
      if @lostfound.save
---
INSERT INTO "lostfounds" ("name", "detail", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["detail", ""], ["category", "money"], ["created_at", "2015-11-22 16:44:01.694391"], ["updated_at", "2015-11-22 16:44:01.694391"]]

  def update
    respond_to do |format|
      if @lostfound.update(lostfound_params)
---
UPDATE "lostfounds" SET "image" = $1, "detail" = $2, "updated_at" = $3 WHERE "lostfounds"."id" = $4  [["image", "2015-10-22_15_17_42______.png"], ["detail", "56+56+"], ["updated_at", "2015-11-23 15:35:50.148167"], ["id", 9]]

  def destroy
    @lostfound.destroy
---
DELETE FROM "lostfounds" WHERE "lostfounds"."id" = $1  [["id", 1]]

    def set_lostfound
      @lostfound = Lostfound.find(params[:id])
---
SELECT  "lostfounds".* FROM "lostfounds" WHERE "lostfounds"."id" = $1 LIMIT 1  [["id", 9]]